Tekla.Structures.Drawing.PropertyElement
The PropertyElement class may represent any of the many different mark element types, such as the profile, the material and the name.
The property is defined by the name and it is converted into a textual value before the mark is drawn.

Tekla.Structures.Drawing.PropertyElement.Name
The property name.

Tekla.Structures.Drawing.PropertyElement.Value
The current value of the property.

Tekla.Structures.Drawing.PropertyElement.Font
The font of the property.

Tekla.Structures.Drawing.PropertyElement.PropertyType
The type of the property element.

Tekla.Structures.Drawing.PropertyElement.#ctor(Tekla.Structures.Drawing.PropertyElement.PropertyElementType)
Creates a new property element instance with the given property element type.
PropertyType: The property element type to be used.

Tekla.Structures.Drawing.PropertyElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.PropertyElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PropertyElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.